Revit 2027 API
IFCGeometryInfo.CreateFaceGeometryInfo(Double) Method
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCGeometryInfo CreateFaceGeometryInfo(
	double epsilon
)
Public Shared Function CreateFaceGeometryInfo (
	epsilon As Double
) As IFCGeometryInfo
public:
static IFCGeometryInfo^ CreateFaceGeometryInfo(
	double epsilon
)
static member CreateFaceGeometryInfo :
        epsilon : float -> IFCGeometryInfo
Parameters
epsilon Double
 The epsilon value used to process surfaces.
Return Value
IFCGeometryInfo
 The new geometry info container.
See Also
Reference
IFCGeometryInfo Class
CreateFaceGeometryInfo Overload
Autodesk.Revit.DB.IFC Namespace